;COMPLETION
(package! cape)

(package! corfu)

;(package! nerd-icons-corfu)

(package! corfu-candidate-overlay)

(package! prescient)
(package! corfu-prescient)

(package! orderless)

(package! pcmpl-args)

(package! chatgpt-shell)
;(package! dall-e-shell)

;VISUAL
(package! all-the-icons)
(package! doom-themes)
;PYTHON____________________
(package! poetry)
(package! lsp-pyright)
(package! virtualenvwrapper)
(package! dap-mode)
(package! iedit)
;;(package! lsp-python-ms)
(package! nose)
(package! python-pytest)
(package! py-isort)
(package! python-black)
;ORG_____________________
(package! org-modern)
(package! org-download)
(package! pandoc)
(package! ox-pandoc)
;MATH____________________
;(package! xenops)
(package! org-fragtog)
(package! auctex)
;MISC_____________________
(package! ssh-agency)

(package! codeium :recipe (:host github :repo "Exafunction/codeium.el"))
