;; VISUAL
(package! all-the-icons)
(package! doom-themes)

(package! iedit)

;COMPLETION
(package! cape)

(package! corfu)

(package! nerd-icons-corfu)

(package! corfu-candidate-overlay)

(package! prescient)
(package! corfu-prescient)

(package! orderless)

(package! pcmpl-args)

(package! chatgpt-shell)
;(package! dall-e-shell)

(package! org-download)

(package! org-modern)

;; MATH
;(package! xenops)
(package! org-fragtog)
(package! auctex)

(package! ssh-agency)

(package! codeium :recipe (:host github :repo "Exafunction/codeium.el"))

;; PYTHON
;;(package! lsp-python-ms)
(package! lsp-pyright)
(package! dap-mode) ;; debugger
(package! python-black) ;; style guide for python
(package! py-isort) ;; required for black, reformats code on save

(package! poetry)
(package! virtualenvwrapper)

(package! python-pytest)
(package! nose)
